### Series, DataFrame

### Exploratory Data Analysis

In [71]:
import pandas as pd
import numpy as np

#### Series

In [72]:
mydata = ["Linear regression", "Logistic regression", "SVM", "PCA"]

In [73]:
myseries1 = pd.Series(mydata)

In [74]:
myseries1

0      Linear regression
1    Logistic regression
2                    SVM
3                    PCA
dtype: object

In [75]:
type(myseries1)

pandas.core.series.Series

In [76]:
myseries1[0]

'Linear regression'

In [77]:
data = [34, 2, 5, 45]

In [78]:
myseries2 = pd.Series(data)

In [79]:
type(myseries2)

pandas.core.series.Series

#### DataFrame

In [80]:
my_dfdata = mydata = [("Linear regression", 34), ("Logistic regression", 2), ("SVM", 5), ("PCA", 45)]

In [81]:
mydf = pd.DataFrame(my_dfdata)
mydf

                     0   1
0    Linear regression  34
1  Logistic regression   2
2                  SVM   5
3                  PCA  45

In [82]:
mydf = pd.DataFrame(my_dfdata, columns = ["Algo_name", "Number"])
mydf

             Algo_name  Number
0    Linear regression      34
1  Logistic regression       2
2                  SVM       5
3                  PCA      45

In [83]:
mydf["Algo_name"]

0      Linear regression
1    Logistic regression
2                    SVM
3                    PCA
Name: Algo_name, dtype: object

In [84]:
type(mydf["Algo_name"])

pandas.core.series.Series

In [85]:
mydf.Algo_name

0      Linear regression
1    Logistic regression
2                    SVM
3                    PCA
Name: Algo_name, dtype: object

In [86]:
mydf.loc[0]

Algo_name    Linear regression
Number                      34
Name: 0, dtype: object

#### Read CSV

In [87]:
df = pd.read_csv('data.csv')
df

            name                          email           phone  favorite
0  Allen Raymond      nulla.ante@vestibul.co.uk  (992) 914-3792     False
1    Chaim Lewis            dui.in@egetlacus.ca  (294) 840-6685     False
2   Kennedy Lane  mattis.Cras@nonenimMauris.net  (542) 451-7038      True
3     Wylie Pope              est@utquamvel.net  (692) 802-2949     False
4  Cyrus Jackson         nibh@semsempererat.com  (501) 472-5218      True

In [88]:
df.head(2)

            name                      email           phone  favorite
0  Allen Raymond  nulla.ante@vestibul.co.uk  (992) 914-3792     False
1    Chaim Lewis        dui.in@egetlacus.ca  (294) 840-6685     False

In [89]:
df.tail(2)

            name                   email           phone  favorite
3     Wylie Pope       est@utquamvel.net  (692) 802-2949     False
4  Cyrus Jackson  nibh@semsempererat.com  (501) 472-5218      True

In [90]:
df.shape

(5, 4)

In [91]:
df.columns

Index(['name', 'email', 'phone', 'favorite'], dtype='object')

In [92]:
new_df = df[['name', 'phone', 'favorite']]

In [93]:
new_df

            name           phone  favorite
0  Allen Raymond  (992) 914-3792     False
1    Chaim Lewis  (294) 840-6685     False
2   Kennedy Lane  (542) 451-7038      True
3     Wylie Pope  (692) 802-2949     False
4  Cyrus Jackson  (501) 472-5218      True

In [94]:
df.dtypes

name        object
email       object
phone       object
favorite      bool
dtype: object

In [95]:
df.describe()

                 name                      email           phone favorite
count               5                          5               5        5
unique              5                          5               5        2
top     Allen Raymond  nulla.ante@vestibul.co.uk  (992) 914-3792    False
freq                1                          1               1        3

In [96]:
df["email"]

0        nulla.ante@vestibul.co.uk
1              dui.in@egetlacus.ca
2    mattis.Cras@nonenimMauris.net
3                est@utquamvel.net
4           nibh@semsempererat.com
Name: email, dtype: object

In [97]:
df.loc[:0]

            name                      email           phone  favorite
0  Allen Raymond  nulla.ante@vestibul.co.uk  (992) 914-3792     False

In [98]:
df.favorite.values

array([False, False,  True, False,  True])

In [99]:
len(set(df.favorite.values))

2

In [100]:
new_df2 = df.set_index("name")
new_df2

                                       email           phone  favorite
name
Allen Raymond      nulla.ante@vestibul.co.uk  (992) 914-3792     False
Chaim Lewis              dui.in@egetlacus.ca  (294) 840-6685     False
Kennedy Lane   mattis.Cras@nonenimMauris.net  (542) 451-7038      True
Wylie Pope                 est@utquamvel.net  (692) 802-2949     False
Cyrus Jackson         nibh@semsempererat.com  (501) 472-5218      True

In [101]:
# new_df2.loc[0] = KeyError
new_df2.loc["Chaim Lewis"]

email       dui.in@egetlacus.ca
phone            (294) 840-6685
favorite                  False
Name: Chaim Lewis, dtype: object

In [102]:
new_df2.iloc[0]

email       nulla.ante@vestibul.co.uk
phone                  (992) 914-3792
favorite                        False
Name: Allen Raymond, dtype: object

#### Subset

In [103]:
df.columns

Index(['name', 'email', 'phone', 'favorite'], dtype='object')

In [104]:
new_df3 = df[['name', 'phone', 'favorite']]
new_df3

            name           phone  favorite
0  Allen Raymond  (992) 914-3792     False
1    Chaim Lewis  (294) 840-6685     False
2   Kennedy Lane  (542) 451-7038      True
3     Wylie Pope  (692) 802-2949     False
4  Cyrus Jackson  (501) 472-5218      True

In [105]:
new_df3["favorite"] == True

0    False
1    False
2     True
3    False
4     True
Name: favorite, dtype: bool

In [106]:
new_df3.loc[new_df3["favorite"] == True]

            name           phone  favorite
2   Kennedy Lane  (542) 451-7038      True
4  Cyrus Jackson  (501) 472-5218      True

In [107]:
new_df4 = new_df3.loc[new_df3["favorite"] == True]
new_df4 # subset 1

            name           phone  favorite
2   Kennedy Lane  (542) 451-7038      True
4  Cyrus Jackson  (501) 472-5218      True

In [108]:
new_df5 = df.query("favorite == True")
new_df5 # subset 2

            name                          email           phone  favorite
2   Kennedy Lane  mattis.Cras@nonenimMauris.net  (542) 451-7038      True
4  Cyrus Jackson         nibh@semsempererat.com  (501) 472-5218      True

#### Check NaNs

In [109]:
new_df5["favorite"].isna()

2    False
4    False
Name: favorite, dtype: bool

In [110]:
df["favorite"].isna()

0    False
1    False
2    False
3    False
4    False
Name: favorite, dtype: bool

In [111]:
~df["favorite"].isna()
# checks not (~) NaNs

0    True
1    True
2    True
3    True
4    True
Name: favorite, dtype: bool

In [112]:
df.loc[df["favorite"].isna()] # returns row(s) with NaN

Empty DataFrame
Columns: [name, email, phone, favorite]
Index: []

In [ ]:
new_df5 = new_df5.loc[~new_df5["name"].isna()]
new_df5["name"] = new_df5["name"].astype("str") # ???

In [114]:
new_df5.dtypes

name        object
email       object
phone       object
favorite      bool
dtype: object

In [ ]:
df["email"] = df["email"].astype("str") # ???

In [118]:
df.dtypes

name        object
email       object
phone       object
favorite      bool
dtype: object

In [ ]:
# df["time_column"] = pd.to_datetime(df.time_column)

#### New column creation

In [119]:
df

            name                          email           phone  favorite
0  Allen Raymond      nulla.ante@vestibul.co.uk  (992) 914-3792     False
1    Chaim Lewis            dui.in@egetlacus.ca  (294) 840-6685     False
2   Kennedy Lane  mattis.Cras@nonenimMauris.net  (542) 451-7038      True
3     Wylie Pope              est@utquamvel.net  (692) 802-2949     False
4  Cyrus Jackson         nibh@semsempererat.com  (501) 472-5218      True

In [ ]:
# df["Likes_vs_Views"] = df["LikeCount"] / df["viewCount"]
# df

#### New row addition

In [120]:
df_row = df.iloc[3:4]
df_row

         name              email           phone  favorite
3  Wylie Pope  est@utquamvel.net  (692) 802-2949     False

In [121]:
df7 = pd.concat([df, df_row])
df7

            name                          email           phone  favorite
0  Allen Raymond      nulla.ante@vestibul.co.uk  (992) 914-3792     False
1    Chaim Lewis            dui.in@egetlacus.ca  (294) 840-6685     False
2   Kennedy Lane  mattis.Cras@nonenimMauris.net  (542) 451-7038      True
3     Wylie Pope              est@utquamvel.net  (692) 802-2949     False
4  Cyrus Jackson         nibh@semsempererat.com  (501) 472-5218      True
3     Wylie Pope              est@utquamvel.net  (692) 802-2949     False